artillery/environments/1000-rpm.yml
config:
  target: "http://localhost:8080"

  http:
    timeout: 60000
    pool: 200

  ensure:
    maxErrorRate: 10

  maxVusers: 500

  phases:
    - duration: 60
      arrivalRate: 3
      name: "Ramp to 200 RPM"

    - duration: 60
      arrivalRate: 7
      name: "Ramp to 400 RPM"

    - duration: 60
      arrivalRate: 10
      name: "Ramp to 600 RPM"

    - duration: 60
      arrivalRate: 13
      name: "Ramp to 800 RPM"

    - duration: 60
      arrivalRate: 17
      name: "Ramp to 1000 RPM"

  processor: "../processor.js"