artillery/environments/10000-rpm.yml
config:
  target: "http://localhost:8080"

  http:
    timeout: 60000
    pool: 1000

  ensure:
    maxErrorRate: 100

  maxVusers: 2000

  phases:
    - duration: 60
      arrivalRate: 33
      name: "2K RPM"

    - duration: 60
      arrivalRate: 66
      name: "4K RPM"

    - duration: 60
      arrivalRate: 100
      name: "6K RPM"

    - duration: 60
      arrivalRate: 133
      name: "8K RPM"

    - duration: 60
      arrivalRate: 167
      name: "10K RPM"

  processor: "../processor.js"