artillery/environments/10000-rpm.yml
config:
  target: "http://localhost:8080"
  # target: "https://dev-payments.ustaxcourt.gov"

  http:
    timeout: 60000
    pool: 50

  ensure:
    maxErrorRate: 100

  phases:
    - duration: 30
      arrivalRate: 167
      name: stress-10000-rpm

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  processor: "../processor.js"