artillery/environments/ramp-test.yml
config:
  target: "http://localhost:8080"

  http:
    timeout: 60000
    pool: 50

  plugins:
    fake-data: {}

  ensure:
    maxErrorRate: 100

  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 167
      name: full-flow-ramp

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  processor: "../processor.js"